Autodesk.Revit.UI.IExternalDataManagerServerProxy.IsEnabledInFamilyDocuments
Checks if the data type enabled in family documents.
Remarks:
Revit calls this once when registering the server with a document to
determine whether the server should be exposed inside the Family
Editor. Return false if the data type relies on project-only
documents.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.GetContentTools(Autodesk.Revit.DB.Document)
Obtains the content tool items of the selected data
Remarks:
The returned tool structure is used to build the context-sensitive
content tools shown above the data grid and the right-click menu. The server
can tailor the list based on current selection.
document:
The document.
Returns:
The content tool items of the selected data.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.GetPreviewImageFile(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.ExternalDataManagerDataItemId)
Retrieves the handle of preview image.
Remarks:
Alternative to getPreviewImage: provide a temporary file path that
contains the preview bitmap. Useful when the preview is larger than
what can reasonably be kept in memory or when the generation happens
in another process.
document:
The document.
dataId:
The id of data.
Returns:
The path of the preview image file.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.GetPreviewImage(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.ExternalDataManagerDataItemId)
Retrieves the handle of preview image.
Remarks:
Provides a WIN32 HBITMAP handle (or platform equivalent) representing
a small preview (typically 256X256). The dialog takes ownership and
will call DeleteObject when done. Return nullptr if the server cannot
supply a preview or if generating it would be expensive.
document:
The document.
dataId:
The id of data.
Returns:
The handle of the preview image.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.IsCommandEnabled(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.ExternalDataManagerCommandId,System.Collections.Generic.IList{Autodesk.Revit.UI.ExternalDataManagerDataItemId})
Checks if the command is enabled.
Remarks:
Revit calls this whenever the selection changes to grey-out commands
that are not currently applicable. The method should be FAST; avoid
any heavy processing or disk I/O.
document:
The document.
commandId:
The command name.
dataIds:
The selected data ids.
Returns:
Whether the command is enabled or not.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.OnCommand(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.ExternalDataManagerCommandId,System.Collections.Generic.IList{Autodesk.Revit.UI.ExternalDataManagerDataItemId})
Handles user command.
Remarks:
This is the main execution entry point when the user triggers a command
through the dialog UI (context menu, or content tool).
dataIds may be empty for commands that do not require selection
(e.g. Add).
Throwing an exception rolls back the surrounding transaction group
and shows an error dialog.
document:
The document.
commandId:
The command name.
dataIds:
The selected data ids.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.GetCommandsForAdd
Retrieves commands in the Add menu.
Remarks:
The returned ids define the drop-down list attached to the "Add" button
in the dialog toolbar. Return an empty array if the server does not
support adding new content.
The ids must correspond to commands previously registered via
ExternalDataManagerCommand.registerCommand.
Returns:
The commands ids for the Add menu.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.GetData(Autodesk.Revit.DB.Document)
Obtains the data.
Remarks:
Revit requests the data whenever the Manage Links dialog needs
to populate or refresh its table. Implementations should return the
full, up-to-date set, even if only a subset has changed, because the UI
performs its own diff to minimize redraws.
Performance tips:
Avoid heavy I/O inside this call; maintain a lightweight in-memory
cache and refresh it asynchronously where possible.
The array may be large; reserve capacity when building it to avoid
excessive reallocations.
document:
The document..
Returns:
Empty if the server has no data.
Since:
2027

Autodesk.Revit.UI.IExternalDataManagerServerProxy.GetTitle
Obtains the title for the external data.
Remarks:
The title is shown as the header text of the Manage Links UI.
It should be concise (ideally one or two words) and fully localized.
Revit calls this once per server instance when the dialog is opened; the
value may be cached on the UI side until the dialog is closed.
Since:
2027